levizh/rt-thread/bsp/hc32/ev_hc32f4a0_lqfp176/board/board_config.h
/*********** TIMA_PULSE_ENCODER configure *********/
#if defined(RT_USING_PULSE_ENCODER)
    #if defined(BSP_USING_TIMERA_PULSE_ENCODER)
        #if defined(BSP_USING_PULSE_ENCODER_TIMA_1)
            #define PULSE_ENCODER_TIMA_1_A_PORT      (GPIO_PORT_A)
            #define PULSE_ENCODER_TIMA_1_A_PIN       (GPIO_PIN_08)
            #define PULSE_ENCODER_TIMA_1_A_PIN_FUNC  (GPIO_FUNC_4)
            #define PULSE_ENCODER_TIMA_1_B_PORT      (GPIO_PORT_A)
            #define PULSE_ENCODER_TIMA_1_B_PIN       (GPIO_PIN_09)
            #define PULSE_ENCODER_TIMA_1_B_PIN_FUNC  (GPIO_FUNC_4)
        #endif /* BSP_USING_PULSE_ENCODER_TIMA_1 */
        #if defined(BSP_USING_PULSE_ENCODER_TIMA_2)
            #define PULSE_ENCODER_TIMA_2_A_PORT      (GPIO_PORT_D)
            #define PULSE_ENCODER_TIMA_2_A_PIN       (GPIO_PIN_09)
            #define PULSE_ENCODER_TIMA_2_A_PIN_FUNC  (GPIO_FUNC_4)
            #define PULSE_ENCODER_TIMA_2_B_PORT      (GPIO_PORT_D)
            #define PULSE_ENCODER_TIMA_2_B_PIN       (GPIO_PIN_10)
            #define PULSE_ENCODER_TIMA_2_B_PIN_FUNC  (GPIO_FUNC_4)
        #endif /* BSP_USING_PULSE_ENCODER_TIMA_2 */
        #if defined(BSP_USING_PULSE_ENCODER_TIMA_3)
            #define PULSE_ENCODER_TIMA_3_A_PORT      (GPIO_PORT_C)
            #define PULSE_ENCODER_TIMA_3_A_PIN       (GPIO_PIN_06)
            #define PULSE_ENCODER_TIMA_3_A_PIN_FUNC  (GPIO_FUNC_4)
            #define PULSE_ENCODER_TIMA_3_B_PORT      (GPIO_PORT_C)
            #define PULSE_ENCODER_TIMA_3_B_PIN       (GPIO_PIN_07)
            #define PULSE_ENCODER_TIMA_3_B_PIN_FUNC  (GPIO_FUNC_4)
        #endif /* BSP_USING_PULSE_ENCODER_TIMA_3 */
        #if defined(BSP_USING_PULSE_ENCODER_TIMA_4)
            #define PULSE_ENCODER_TIMA_4_A_PORT      (GPIO_PORT_D)
            #define PULSE_ENCODER_TIMA_4_A_PIN       (GPIO_PIN_12)
            #define PULSE_ENCODER_TIMA_4_A_PIN_FUNC  (GPIO_FUNC_4)
            #define PULSE_ENCODER_TIMA_4_B_PORT      (GPIO_PORT_D)
            #define PULSE_ENCODER_TIMA_4_B_PIN       (GPIO_PIN_13)
            #define PULSE_ENCODER_TIMA_4_B_PIN_FUNC  (GPIO_FUNC_4)
        #endif /* BSP_USING_PULSE_ENCODER_TIMA_4 */
        #if defined(BSP_USING_PULSE_ENCODER_TIMA_5)
            #define PULSE_ENCODER_TIMA_5_A_PORT      (GPIO_PORT_C)
            #define PULSE_ENCODER_TIMA_5_A_PIN       (GPIO_PIN_10)
            #define PULSE_ENCODER_TIMA_5_A_PIN_FUNC  (GPIO_FUNC_5)
            #define PULSE_ENCODER_TIMA_5_B_PORT      (GPIO_PORT_C)
            #define PULSE_ENCODER_TIMA_5_B_PIN       (GPIO_PIN_11)
            #define PULSE_ENCODER_TIMA_5_B_PIN_FUNC  (GPIO_FUNC_5)
        #endif /* BSP_USING_PULSE_ENCODER_TIMA_5 */
        #if defined(BSP_USING_PULSE_ENCODER_TIMA_6)
            #define PULSE_ENCODER_TIMA_6_A_PORT      (GPIO_PORT_D)
            #define PULSE_ENCODER_TIMA_6_A_PIN       (GPIO_PIN_04)
            #define PULSE_ENCODER_TIMA_6_A_PIN_FUNC  (GPIO_FUNC_4)
            #define PULSE_ENCODER_TIMA_6_B_PORT      (GPIO_PORT_D)
            #define PULSE_ENCODER_TIMA_6_B_PIN       (GPIO_PIN_05)
            #define PULSE_ENCODER_TIMA_6_B_PIN_FUNC  (GPIO_FUNC_4)
        #endif /* BSP_USING_PULSE_ENCODER_TIMA_6 */
        #if defined(BSP_USING_PULSE_ENCODER_TIMA_7)
            #define PULSE_ENCODER_TIMA_7_A_PORT      (GPIO_PORT_B)
            #define PULSE_ENCODER_TIMA_7_A_PIN       (GPIO_PIN_13)
            #define PULSE_ENCODER_TIMA_7_A_PIN_FUNC  (GPIO_FUNC_4)
            #define PULSE_ENCODER_TIMA_7_B_PORT      (GPIO_PORT_B)
            #define PULSE_ENCODER_TIMA_7_B_PIN       (GPIO_PIN_14)
            #define PULSE_ENCODER_TIMA_7_B_PIN_FUNC  (GPIO_FUNC_4)
        #endif /* BSP_USING_PULSE_ENCODER_TIMA_7 */
        #if defined(BSP_USING_PULSE_ENCODER_TIMA_8)
            #define PULSE_ENCODER_TIMA_8_A_PORT      (GPIO_PORT_C)
            #define PULSE_ENCODER_TIMA_8_A_PIN       (GPIO_PIN_00)
            #define PULSE_ENCODER_TIMA_8_A_PIN_FUNC  (GPIO_FUNC_4)
            #define PULSE_ENCODER_TIMA_8_B_PORT      (GPIO_PORT_C)
            #define PULSE_ENCODER_TIMA_8_B_PIN       (GPIO_PIN_01)
            #define PULSE_ENCODER_TIMA_8_B_PIN_FUNC  (GPIO_FUNC_4)
        #endif /* BSP_USING_PULSE_ENCODER_TIMA_8 */
        #if defined(BSP_USING_PULSE_ENCODER_TIMA_9)
            #define PULSE_ENCODER_TIMA_9_A_PORT      (GPIO_PORT_G)
            #define PULSE_ENCODER_TIMA_9_A_PIN       (GPIO_PIN_04)
            #define PULSE_ENCODER_TIMA_9_A_PIN_FUNC  (GPIO_FUNC_4)
            #define PULSE_ENCODER_TIMA_9_B_PORT      (GPIO_PORT_G)
            #define PULSE_ENCODER_TIMA_9_B_PIN       (GPIO_PIN_05)
            #define PULSE_ENCODER_TIMA_9_B_PIN_FUNC  (GPIO_FUNC_4)
        #endif /* BSP_USING_PULSE_ENCODER_TIMA_9 */
        #if defined(BSP_USING_PULSE_ENCODER_TIMA_10)
            #define PULSE_ENCODER_TIMA_10_A_PORT      (GPIO_PORT_F)
            #define PULSE_ENCODER_TIMA_10_A_PIN       (GPIO_PIN_06)
            #define PULSE_ENCODER_TIMA_10_A_PIN_FUNC  (GPIO_FUNC_4)
            #define PULSE_ENCODER_TIMA_10_B_PORT      (GPIO_PORT_F)
            #define PULSE_ENCODER_TIMA_10_B_PIN       (GPIO_PIN_07)
            #define PULSE_ENCODER_TIMA_10_B_PIN_FUNC  (GPIO_FUNC_4)
        #endif /* BSP_USING_PULSE_ENCODER_TIMA_10 */
        #if defined(BSP_USING_PULSE_ENCODER_TIMA_11)
            #define PULSE_ENCODER_TIMA_11_A_PORT      (GPIO_PORT_F)
            #define PULSE_ENCODER_TIMA_11_A_PIN       (GPIO_PIN_00)
            #define PULSE_ENCODER_TIMA_11_A_PIN_FUNC  (GPIO_FUNC_5)
            #define PULSE_ENCODER_TIMA_11_B_PORT      (GPIO_PORT_F)
            #define PULSE_ENCODER_TIMA_11_B_PIN       (GPIO_PIN_01)
            #define PULSE_ENCODER_TIMA_11_B_PIN_FUNC  (GPIO_FUNC_5)
        #endif /* BSP_USING_PULSE_ENCODER_TIMA_11 */
        #if defined(BSP_USING_PULSE_ENCODER_TIMA_12)
            #define PULSE_ENCODER_TIMA_12_A_PORT      (GPIO_PORT_D)
            #define PULSE_ENCODER_TIMA_12_A_PIN       (GPIO_PIN_01)
            #define PULSE_ENCODER_TIMA_12_A_PIN_FUNC  (GPIO_FUNC_5)
            #define PULSE_ENCODER_TIMA_12_B_PORT      (GPIO_PORT_D)
            #define PULSE_ENCODER_TIMA_12_B_PIN       (GPIO_PIN_02)
            #define PULSE_ENCODER_TIMA_12_B_PIN_FUNC  (GPIO_FUNC_5)
        #endif /* BSP_USING_PULSE_ENCODER_TIMA_12 */
    #endif /* BSP_USING_TIMERA_PULSE_ENCODER */

    #if defined(BSP_USING_TIMER6_PULSE_ENCODER)
        #if defined(BSP_USING_PULSE_ENCODER_TIM6_1)
            #define PULSE_ENCODER_TIM6_1_A_PORT      (GPIO_PORT_B)
            #define PULSE_ENCODER_TIM6_1_A_PIN       (GPIO_PIN_09)
            #define PULSE_ENCODER_TIM6_1_A_PIN_FUNC  (GPIO_FUNC_3)
            #define PULSE_ENCODER_TIM6_1_B_PORT      (GPIO_PORT_B)
            #define PULSE_ENCODER_TIM6_1_B_PIN       (GPIO_PIN_08)
            #define PULSE_ENCODER_TIM6_1_B_PIN_FUNC  (GPIO_FUNC_3)
        #endif /* BSP_USING_PULSE_ENCODER_TIM6_1 */
        #if defined(BSP_USING_PULSE_ENCODER_TIM6_2)
            #define PULSE_ENCODER_TIM6_2_A_PORT      (GPIO_PORT_E)
            #define PULSE_ENCODER_TIM6_2_A_PIN       (GPIO_PIN_11)
            #define PULSE_ENCODER_TIM6_2_A_PIN_FUNC  (GPIO_FUNC_3)
            #define PULSE_ENCODER_TIM6_2_B_PORT      (GPIO_PORT_E)
            #define PULSE_ENCODER_TIM6_2_B_PIN       (GPIO_PIN_10)
            #define PULSE_ENCODER_TIM6_2_B_PIN_FUNC  (GPIO_FUNC_3)
        #endif /* BSP_USING_PULSE_ENCODER_TIM6_2 */
        #if defined(BSP_USING_PULSE_ENCODER_TIM6_3)
            #define PULSE_ENCODER_TIM6_3_A_PORT      (GPIO_PORT_E)
            #define PULSE_ENCODER_TIM6_3_A_PIN       (GPIO_PIN_13)
            #define PULSE_ENCODER_TIM6_3_A_PIN_FUNC  (GPIO_FUNC_3)
            #define PULSE_ENCODER_TIM6_3_B_PORT      (GPIO_PORT_E)
            #define PULSE_ENCODER_TIM6_3_B_PIN       (GPIO_PIN_12)
            #define PULSE_ENCODER_TIM6_3_B_PIN_FUNC  (GPIO_FUNC_3)
        #endif /* BSP_USING_PULSE_ENCODER_TIM6_3 */
        #if defined(BSP_USING_PULSE_ENCODER_TIM6_4)
            #define PULSE_ENCODER_TIM6_4_A_PORT      (GPIO_PORT_H)
            #define PULSE_ENCODER_TIM6_4_A_PIN       (GPIO_PIN_10)
            #define PULSE_ENCODER_TIM6_4_A_PIN_FUNC  (GPIO_FUNC_3)
            #define PULSE_ENCODER_TIM6_4_B_PORT      (GPIO_PORT_H)
            #define PULSE_ENCODER_TIM6_4_B_PIN       (GPIO_PIN_11)
            #define PULSE_ENCODER_TIM6_4_B_PIN_FUNC  (GPIO_FUNC_3)
        #endif /* BSP_USING_PULSE_ENCODER_TIM6_4 */
        #if defined(BSP_USING_PULSE_ENCODER_TIM6_5)
            #define PULSE_ENCODER_TIM6_5_A_PORT      (GPIO_PORT_C)
            #define PULSE_ENCODER_TIM6_5_A_PIN       (GPIO_PIN_10)
            #define PULSE_ENCODER_TIM6_5_A_PIN_FUNC  (GPIO_FUNC_3)
            #define PULSE_ENCODER_TIM6_5_B_PORT      (GPIO_PORT_D)
            #define PULSE_ENCODER_TIM6_5_B_PIN       (GPIO_PIN_00)
            #define PULSE_ENCODER_TIM6_5_B_PIN_FUNC  (GPIO_FUNC_3)
        #endif /* BSP_USING_PULSE_ENCODER_TIM6_5 */
        #if defined(BSP_USING_PULSE_ENCODER_TIM6_6)
            #define PULSE_ENCODER_TIM6_6_A_PORT      (GPIO_PORT_A)
            #define PULSE_ENCODER_TIM6_6_A_PIN       (GPIO_PIN_02)
            #define PULSE_ENCODER_TIM6_6_A_PIN_FUNC  (GPIO_FUNC_3)
            #define PULSE_ENCODER_TIM6_6_B_PORT      (GPIO_PORT_A)
            #define PULSE_ENCODER_TIM6_6_B_PIN       (GPIO_PIN_03)
            #define PULSE_ENCODER_TIM6_6_B_PIN_FUNC  (GPIO_FUNC_3)
        #endif /* BSP_USING_PULSE_ENCODER_TIM6_6 */
        #if defined(BSP_USING_PULSE_ENCODER_TIM6_7)
            #define PULSE_ENCODER_TIM6_7_A_PORT      (GPIO_PORT_A)
            #define PULSE_ENCODER_TIM6_7_A_PIN       (GPIO_PIN_04)
            #define PULSE_ENCODER_TIM6_7_A_PIN_FUNC  (GPIO_FUNC_3)
            #define PULSE_ENCODER_TIM6_7_B_PORT      (GPIO_PORT_A)
            #define PULSE_ENCODER_TIM6_7_B_PIN       (GPIO_PIN_05)
            #define PULSE_ENCODER_TIM6_7_B_PIN_FUNC  (GPIO_FUNC_3)
        #endif /* BSP_USING_PULSE_ENCODER_TIM6_7 */
        #if defined(BSP_USING_PULSE_ENCODER_TIM6_8)
            #define PULSE_ENCODER_TIM6_8_A_PORT      (GPIO_PORT_C)
            #define PULSE_ENCODER_TIM6_8_A_PIN       (GPIO_PIN_08)
            #define PULSE_ENCODER_TIM6_8_A_PIN_FUNC  (GPIO_FUNC_3)
            #define PULSE_ENCODER_TIM6_8_B_PORT      (GPIO_PORT_C)
            #define PULSE_ENCODER_TIM6_8_B_PIN       (GPIO_PIN_09)
            #define PULSE_ENCODER_TIM6_8_B_PIN_FUNC  (GPIO_FUNC_3)
        #endif /* BSP_USING_PULSE_ENCODER_TIM6_8 */
    #endif /* BSP_USING_TIMER6_PULSE_ENCODER */
#endif /* RT_USING_PULSE_ENCODER */

#endif

